In [7]:
import pandas as pd
import sys

In [2]:
cd input_files

/Users/Leehyunjoo/Dev/09_study/analytics-with-python/chapter_02/input_files

In [3]:
ls

deal_1.csv
deal_2.csv
deal_3.csv
sales_february_2014.csv
sales_january_2014.csv
sales_march_2014.csv
supplier_data.csv
supplier_data_unnecessary_header_footer.csv
supplier_data_without_header.csv

In [158]:
cat supplier_data_unnecessary_header_footer.csv

I don't care about this row,,,,
I don't care about this row,,,,
I don't care about this row,,,,
Supplier Name,Invoice Number,Part Number,Cost,Purchase Date
Supplier X,001-1001,2341,$500.00 ,1/20/2014
Supplier X,001-1001,2341,$500.00 ,1/20/2014
Supplier X,001-1001,5467,$750.00 ,1/20/2014
Supplier Z,920-4805,3321,$615.00 ,2/17/2014
Supplier Z,920-4806,3321,$615.00 ,2/24/2014
I don't want this row either,,,,
I don't want this row either,,,,
I don't want this row either,,,,

## 특정 행번호만 선택하기

In [159]:
data_frame = pd.read_csv('supplier_data_unnecessary_header_footer.csv', header=None)
data_frame

,0,1,2,3,4
0,I don't care about this row,NaN,NaN,NaN,NaN
1,I don't care about this row,NaN,NaN,NaN,NaN
2,I don't care about this row,NaN,NaN,NaN,NaN
3,Supplier Name,Invoice Number,Part Number,Cost,Purchase Date
4,Supplier X,001-1001,2341,$500.00,1/20/2014
5,Supplier X,001-1001,2341,$500.00,1/20/2014
6,Supplier X,001-1001,5467,$750.00,1/20/2014
7,Supplier Z,920-4805,3321,$615.00,2/17/2014
8,Supplier Z,920-4806,3321,$615.00,2/24/2014
9,I don't want this row either,NaN,NaN,NaN,NaN
10,I don't want this row either,NaN,NaN,NaN,NaN
11,I don't want this row either,NaN,NaN,NaN,NaN

In [160]:
data_frame = data_frame.drop([0,1,2,9,10,11])
data_frame

               0               1            2         3              4
3  Supplier Name  Invoice Number  Part Number      Cost  Purchase Date
4     Supplier X        001-1001         2341  $500.00       1/20/2014
5     Supplier X        001-1001         2341  $500.00       1/20/2014
6     Supplier X        001-1001         5467  $750.00       1/20/2014
7     Supplier Z        920-4805         3321  $615.00       2/17/2014
8     Supplier Z        920-4806         3321  $615.00       2/24/2014

In [161]:
data_frame.iloc[0]

0     Supplier Name
1    Invoice Number
2       Part Number
3              Cost
4     Purchase Date
Name: 3, dtype: object

In [162]:
data_frame.columns = data_frame.iloc[0]  # 헤더 컬럼을 0번 행으로 지정한다. 
data_frame

3  Supplier Name  Invoice Number  Part Number      Cost  Purchase Date
3  Supplier Name  Invoice Number  Part Number      Cost  Purchase Date
4     Supplier X        001-1001         2341  $500.00       1/20/2014
5     Supplier X        001-1001         2341  $500.00       1/20/2014
6     Supplier X        001-1001         5467  $750.00       1/20/2014
7     Supplier Z        920-4805         3321  $615.00       2/17/2014
8     Supplier Z        920-4806         3321  $615.00       2/24/2014

In [163]:
data_frame = data_frame.reindex(data_frame.index.drop(3))
data_frame

3 Supplier Name Invoice Number Part Number      Cost Purchase Date
4    Supplier X       001-1001        2341  $500.00      1/20/2014
5    Supplier X       001-1001        2341  $500.00      1/20/2014
6    Supplier X       001-1001        5467  $750.00      1/20/2014
7    Supplier Z       920-4805        3321  $615.00      2/17/2014
8    Supplier Z       920-4806        3321  $615.00      2/24/2014

In [164]:
data_frame.to_csv('../output_files/pandas_output_select_rows.csv', index=False)

In [166]:
cat ../output_files/pandas_output_select_rows.csv

Supplier Name,Invoice Number,Part Number,Cost,Purchase Date
Supplier X,001-1001,2341,$500.00 ,1/20/2014
Supplier X,001-1001,2341,$500.00 ,1/20/2014
Supplier X,001-1001,5467,$750.00 ,1/20/2014
Supplier Z,920-4805,3321,$615.00 ,2/17/2014
Supplier Z,920-4806,3321,$615.00 ,2/24/2014

## 헤더 추가하기 (137p)

In [167]:
header_list = ['Supplier Name', 'Invoice Number', 'Part Number', 'Cost', 'Purchase Date']

In [173]:
data_frame = pd.read_csv('./supplier_data_without_header.csv', header=None, names=header_list)
data_frame

  Supplier Name Invoice Number  Part Number      Cost Purchase Date
0    Supplier X       001-1001         2341  $500.00      1/20/2014
1    Supplier X       001-1001         2341  $500.00      1/20/2014
2    Supplier X       001-1001         5467  $750.00      1/20/2014
3    Supplier Z       920-4805         3321  $615.00      2/17/2014
4    Supplier Z       920-4806         3321  $615.00      2/24/2014

In [174]:
data_frame.to_csv('../output_files/pandas_output_add_header.csv', index=False)

## 여러 파일 합치기

### 파이썬

In [70]:
import glob
import os

In [181]:
# 경로 2개를 합치기
os.path.join('.', 'sales_*')

'./sales_*'

In [180]:
# 현재 경로에서 salse_로 시작하는 모든 파일 목록을 리스트로 가져온다. 
glob.glob('./sales_*')

['./sales_february_2014.csv',
 './sales_january_2014.csv',
 './sales_march_2014.csv']

In [192]:
# 합칠 대상인 파일들을 하나씩 순회한다.
for input_file in glob.glob(os.path.join('.', 'sales_*')):
    print(os.path.basename(input_file))  # 파일명만 가져온다.

sales_february_2014.csv
sales_january_2014.csv
sales_march_2014.csv

In [190]:
# 합칠 대상인 파일들을 하나씩 순회한다.
for input_file in glob.glob(os.path.join('.','sales_*')):
    print(os.path.basename(input_file))  # 파일명만 가져온다.
    
    # 읽기용 파일 열기 
    with open(input_file, 'r', newline='') as csv_in_file:
        
        # 쓰기용 파일 열기 - 'a' : append 모드, 'w' : write 모드 (덮어쓰기)
        with open('../output_files/pandas_conacat_files.csv', 'a', newline='') as csv_out_file:
                  
            filereader = csv.reader(csv_in_file)
            filewriter = csv.writer(csv_out_file)
                  
            # 읽기용 파일을 한줄씩 읽으면서, 쓰기용 파일에 한줄씩 쓰기
            for row in filereader:
                filewriter.writerow(row)

sales_february_2014.csv
sales_january_2014.csv
sales_march_2014.csv

### 팬더스

In [211]:
# 현재 경로에서 salse_로 시작하는 모든 파일 목록을 리스트로 가져온다. 
all_files = glob.glob(os.path.join('.', 'sales_*'))
all_files

['./sales_february_2014.csv',
 './sales_january_2014.csv',
 './sales_march_2014.csv']

In [222]:
all_data_frames = []

# 합칠 대상인 파일들을 하나씩 순회한다.
for file in all_files:
    
    # 판다스 data_frame 형식으로 읽기 파일을 가져와서 
    data_frame = pd.read_csv(file)
    
    # all_data_frames 리스트에 추가한다. 
    all_data_frames.append(data_frame)

# concat 메소드를 사용해서 all_data_frames 리스트 안의 모든 data frame을 하나로 합친다. 
data_frame_concat = pd.concat(all_data_frames, ignore_index=True)

# 합친 data frame을 쓰기용 파일에 입력한다.
data_frame_concat.to_csv('../output_files/pandas_output_concat_files.csv', index=False)

data_frame_concat

    Customer ID       Customer Name Invoice Number Sale Amount Purchase Date
0          9876       Daniel Farber       100-0008   $1,115.00        2/2/14
1          8765         Laney Stone       100-0009   $1,367.00        2/8/14
2          7654        Roger Lipney       100-0010   $2,135.00       2/15/14
3          6543       Thomas Haines       100-0011   $1,346.00       2/17/14
4          5432         Anushka Vaz       100-0012   $1,560.00       2/21/14
5          4321      Harriet Cooper       100-0013   $1,852.00       2/25/14
6          1234          John Smith       100-0002   $1,200.00        1/1/14
7          2345       Mary Harrison       100-0003   $1,425.00        1/6/14
8          3456          Lucy Gomez       100-0004   $1,390.00       1/11/14
9          4567        Rupert Jones       100-0005   $1,257.00       1/18/14
10         5678       Jenny Walters       100-0006   $1,725.00       1/24/14
11         6789  Samantha Donaldson       100-0007   $1,995.00       1/31/14
12         1234          John Smith       100-0014   $1,350.00        3/4/14
13         8765           Tony Song       100-0015   $1,167.00        3/8/14
14         2345       Mary Harrison       100-0016   $1,789.00       3/17/14
15         6543          Rachel Paz       100-0017   $2,042.00       3/22/14
16         3456          Lucy Gomez       100-0018   $1,511.00       3/28/14
17         4321       Susan Wallace       100-0019   $2,280.00       3/30/14

##  연습문제

In [5]:
cat supplier_data.csv

### 연습문제 1 - pandas

In [92]:
# Part Number가 7009 이거나 혹은 Cost가 $700.00 이상인 값을 출력
data_frame = pd.read_csv('./supplier_data.csv')

In [66]:
filtering = (data_frame["Part Number"] == 7009) | (data_frame["Cost"].str.strip('$').astype('float') >= 00.00)
filtering

0     False
1     False
2      True
3      True
4      True
5      True
6     False
7     False
8     False
9     False
10    False
11    False
dtype: bool

In [67]:
data_frame[filtering]

  Supplier Name Invoice Number  Part Number     Cost Purchase Date
2    Supplier X       001-1001         5467  $750.00       1/20/14
3    Supplier X       001-1001         5467  $750.00       1/20/14
4    Supplier Y        50-9501         7009  $250.00       1/30/14
5    Supplier Y        50-9501         7009  $250.00       1/30/14

### 연습문제 2 - pandas

In [26]:
data_frame = pd.redata_frame["Cost"].str.strip('$').astype('float')ad_csv('./supplier_data.csv')
data_frame

   Supplier Name Invoice Number  Part Number     Cost Purchase Date
0     Supplier X       001-1001         2341  $500.00       1/20/14
1     Supplier X       001-1001         2341  $500.00       1/20/14
2     Supplier X       001-1001         5467  $750.00       1/20/14
3     Supplier X       001-1001         5467  $750.00       1/20/14
4     Supplier Y        50-9501         7009  $250.00       1/30/14
5     Supplier Y        50-9501         7009  $250.00       1/30/14
6     Supplier Y        50-9505         6650  $125.00        2/3/14
7     Supplier Y        50-9505         6650  $125.00        2/3/14
8     Supplier Z       920-4803         3321  $615.00        2/3/14
9     Supplier Z       920-4804         3321  $615.00       2/10/14
10    Supplier Z       920-4805         3321  $615.00       2/17/14
11    Supplier Z       920-4806         3321  $615.00       2/24/14

In [28]:
column_name_list = ["Invoice Number", "Cost"]
data_frame[column_name_list]

   Invoice Number     Cost
0        001-1001  $500.00
1        001-1001  $500.00
2        001-1001  $750.00
3        001-1001  $750.00
4         50-9501  $250.00
5         50-9501  $250.00
6         50-9505  $125.00
7         50-9505  $125.00
8        920-4803  $615.00
9        920-4804  $615.00
10       920-4805  $615.00
11       920-4806  $615.00

In [29]:
data_frame[column_name_list].to_csv('../output_files/pandas_practice_2.csv', index=False)

In [30]:
cat ../output_files/pandas_practice_2.csv

Invoice Number,Cost
001-1001,$500.00
001-1001,$500.00
001-1001,$750.00
001-1001,$750.00
50-9501,$250.00
50-9501,$250.00
50-9505,$125.00
50-9505,$125.00
920-4803,$615.00
920-4804,$615.00
920-4805,$615.00
920-4806,$615.00

### 연습문제 3 - pandas

In [72]:
files = glob.glob(os.path.join('.', 'deal_*'))
files

['./deal_1.csv', './deal_2.csv', './deal_3.csv']

In [86]:
# pd.read_csv('./deal_1.csv', delimiter=';')

In [88]:
data_frame_list = []

for file in files:
    data_frame = pd.read_csv(file, delimiter=';')
    data_frame_list.append(data_frame)

In [89]:
# result = pd.concat(data_frame_list, ignore_index=True)
# result

In [84]:
result.to_csv('../output_files/pandas_practice_3.csv', index=False)